package com.smida.algrithm.leetcode.editor.cn;
/**
有效的数独
//请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。 
//
// 
// 数字 1-9 在每一行只能出现一次。 
// 数字 1-9 在每一列只能出现一次。 
// 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图） 
// 
//
// 
//
// 注意： 
//
// 
// 一个有效的数独（部分已被填充）不一定是可解的。 
// 只需要根据以上规则，验证已经填入的数字是否有效即可。 
// 空白格用 '.' 表示。 
// 
//
// 
//
// 示例 1： 
//
// 
//输入：board = 
//[["5","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：true
// 
//
// 示例 2： 
//
// 
//输入：board = 
//[["8","3",".",".","7",".",".",".","."]
//,["6",".",".","1","9","5",".",".","."]
//,[".","9","8",".",".",".",".","6","."]
//,["8",".",".",".","6",".",".",".","3"]
//,["4",".",".","8",".","3",".",".","1"]
//,["7",".",".",".","2",".",".",".","6"]
//,[".","6",".",".",".",".","2","8","."]
//,[".",".",".","4","1","9",".",".","5"]
//,[".",".",".",".","8",".",".","7","9"]]
//输出：false
//解释：除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。 但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无
//效的。 
//
// 
//
// 提示： 
//
// 
// board.length == 9 
// board[i].length == 9 
// board[i][j] 是一位数字（1-9）或者 '.' 
// 
// Related Topics 数组 哈希表 矩阵 
// 👍 873 👎 0

 */
public class _36ValidSudoku{
    public static void main(String[] args) {
         Solution solution = new _36ValidSudoku().new Solution();
    }
    //leetcode submit region begin(Prohibit modification and deletion)
class Solution {
        public boolean isValidSudoku(char[][] board) {
            //row[][]数组记录行，第一维代表行数，第二维代表数字，值代表出现几次
            //col[][]数组记录列，第一维代表列数，第二维代表数字，值代表出现几次
            //matrix[][][]数组记录3*3小数独位置，前两维代表相对位置，第三维代表数字，值代表出现次数
            int[][] row = new int[10][10];
            int[][] col = new int[10][10];
            int[][][] matrix = new int[3][3][10];
            for (int i = 0; i < board.length; i++) {
                for (int j = 0; j < board[i].length; j++) {
                    char val = board[i][j];
                    if ('.' != val) {
                        int num = val - '0';
                        row[i][num]++;
                        col[j][num]++;
                        matrix[i/3][j/3][num]++;
                        if (row[i][num] > 1 || col[j][num] > 1 || matrix[i / 3][j / 3][num] > 1) {
                            return false;
                        }
                    }
                }
            }
            return true;
        }
}
//leetcode submit region end(Prohibit modification and deletion)

}